<?
function add_play($Author, $Name, $Subname, $Year, $Link="")
{
	echo "\n        <!--  «".str_replace("<br>"," ", $Name)."» -->\n";
	echo "        <tr class=nt valign=top>\n";
	echo "          <td class=author>{$Author}</td>\n";
	echo "          <td align=center>\n            ";
	if ($Link == "")
	{
		echo "<span class=play_name>«{$Name}»</span>";
	}
	else
	{
		echo "<a href='/sp/{$Link}.php' class=play_name>«{$Name}»</a>";
	}
	if ($Subname == "")
	{
		echo "\n          </td>\n";
	}
	else
	{
		echo "<br>\n            <span class=subtitle>{$Subname}</span>\n          </td>\n";
	};
	echo "          <td class=person align=center>{$Year}г.</td>\n";
	echo "          <td>&nbsp;</td>\n";
	echo "        </tr>\n";
	
	echo "        <tr class=nt>\n";
	for ($i = 1; $i<=4; $i++)
	{
		echo "          <td><IMG src='/cp.gif' width=1 height=20></td>\n";
	};
	echo "        </tr>\n";
}
?>

      <table width="100%" border="0" cellpadding="2">
        <tr class=nt>
          <td>&nbsp;</td>
          <td  class=stress_big_bold_black><i>с 1968 г.</i></td>
          <td align=center class=caption_black colspan=2>Постановки:</td>
          <td>&nbsp;</td>
        </tr>
      </table>
      <br>
      <table width="100%" border="0" cellspacing="0" cellpadding="0">
        <tr>
    <?
	$Width[1] = 20;
	$Width[2] = 50;
	$Width[3] = 10;
	$Width[4] = 20;
	for ($i = 1; $i<=4; $i++)
	{
		echo "          <td width='{$Width[$i]}%'><IMG src='/cp.gif' width=1 height=10></td>\n";
	};
	?>
        </tr>
  
  <?
    add_play("Евг. Шварц","ДРАКОН","сказка с грустным началом,<br>но счастливым концом,<br>понятная даже самому взрослому зрителю",1969);
	add_play("Вл. Маяковский","БАНЯ","драма с цирком и фейерверком",1971);
	add_play("М. Булгаков","ИВАН ВАСИЛЬЕВИЧ","комедия в 3-х актах",1972);
	add_play("А. Арбузов","ВЫБОР","драматическая задача в 2-х частях<br>с прологом и эпилогом",1973);
	add_play("Евг. Шварц","ТЕНЬ","сказка, действие которой происходит<br>в одной очень жаркой стране",1974);
	add_play("Г. Горин","...ЗАБЫТЬ ГЕРОСТРАТА!","фантазия на тему далёкого прошлого в 2-х частях",1975);
	add_play("М.Рощин","СТАРЫЙ НОВЫЙ ГОД","полукомедия в 4-х сновидениях",1976);
	add_play("А. Вампилов","20 МИНУТ С АНГЕЛОМ»<br>«ИСТОРИЯ С МЕТРАНПАЖЕМ","анекдоты в одном действии",1977);
	add_play("Ю. Марцинкявичюс","СЕГОДНЯ НОЧЬЮ И ВСЕГДА...","сновидение в 1 действии",1980);
	add_play("Э. Ветемаа","МОНУМЕНТ","анатомия одной ситуации в 2-х действиях",1981);
	add_play("Ф. Дюрренматт","РОМУЛ ВЕЛИКИЙ","неисторическая историческая комедия в 2-х актах",1982);
	add_play("В. Быков","ИСПЫТАНИЕ","драматическая поэма в 3-х частях<br>по произведениям<br>«Одна ночь», «Круглянский мост», «Волчья стая»",1985);
	add_play("А. Гельман","ЗИНУЛЯ","спектакль загадочного жанра",1986);
	add_play("С. Стратиев","АВТОБУС","рейс без антракта",1986);
	add_play("Сл. Мрожек","ПОЛИЦИЯ","весьма странное дело в 3-х действиях,<br>7-ми картинах без антрактов",1988);
	add_play("О. Уайлд","КЕНТЕРВИЛЬСКОЕ ПРИВИДЕНИЕ","весьма легкомысленная экскурсия<br>по мотивам малознакомого знаменитого писателя",1990);
	add_play("И. Тургенев","ВЕШНИЕ ВОДЫ","история одной жизни в 2-х частях",1992,"vv");
	add_play("Ф. Дюрренматт","МЕТЕОР","комедия в 2-х актах",1993);
	add_play("М. Булгаков","МОЛЬЕР","легенда о знаменитом комедианте",1994);
	add_play("Ж.-Б. Мольер","МИЗАНТРОП","скандалы в будуаре",1996);
	add_play("Ж.-Б. Мольер","ЖОРЖ ДАНДЕН»<br>«БРАК ПОНЕВОЛЕ","дилогия о неудачной женитьбе",1996);
	add_play("Евг. Шварц,<br>М. Булгаков,<br>А. Пушкин,<br>Ж.-Б. Мольер,<br>У. Шейкспиэр,<br>М. Зощенко,<br>М. Митуа,<br>Н. Гоголь","ПРОБА ПЕРА","весьма беглая экскурсия по некоторым шедеврам<br>мировой драматургии и литературы",1999);
	add_play("М. Зощенко","ВЕСЁЛАЯ ЖИЗНЬ","первая попытка открытия Автора",2002,"vj");
	add_play("Ф.К. Крёц","КОНЦЕРТ ПО ЗАЯВКАМ","",2005,"kpz");
	add_play("А. Чехов","СУПРУГА","cтрашная ночь в кабинете Николая Евграфовича",2005,"je_s");
	add_play("А. Чехов","ЖИТЕЙСКИЕ ЭПИЗОДИКИ","",2006,"je_s");
	add_play("Н. Гоголь","ЖЕНИТЬБА","совершенно невероятное событие в двух действиях",2006,"jen");
	add_play("Н.Гоголь","ПОВЕСТЬ О ТОМ<br>КАК ПОССОРИЛСЯ ИВАН ИВАНОВИЧ<br>С ИВАНОМ НИКИФОРОВИЧЕМ","",2008, "ppi");
	add_play("Н.Гоголь","РЕВИЗОР","",2012,"rev");
  ?>
      </table>
      <br><br><br>